{
  "backend/main.mo": "Main Motoko actor for Chess Khelo Online backend; manages game state, player stats, user profiles, and AI match results with role-based access control via AccessControl and MixinAuthorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping two features (full Chess Khelo Online app rebuild and dismissible mobile APK banner) to their respective source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, describing their roles in the chess application including types, utilities, components, hooks, and styles.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme color tokens used throughout the application.",
  "frontend/index.html": "HTML entry point for the Chess Khelo Online Vite/React app, setting viewport meta, favicon, page title, and mounting the React root.",
  "frontend/src/App.tsx": "Root React component that wraps the app in a React Query provider, handles Internet Identity authentication state, renders the header with login/profile controls, the main ChessGame page, a footer, a profile setup modal, and the MobileAppNotice banner.",
  "frontend/src/components/ChessBoard.tsx": "Renders the 8x8 chess board by mapping rows and columns to ChessSquare components with support for flipping, highlighting selected/valid-move/last-move/check squares, and an AI-thinking overlay.",
  "frontend/src/components/ChessSquare.tsx": "Renders a single chess board square with responsive piece font sizing, coordinate labels, and visual overlays for selection, valid moves, last move, and king-in-check states.",
  "frontend/src/components/GameModeSelector.tsx": "Renders a grid of buttons for selecting a game mode (Two Players, vs AI, Auto Play, Online), disabling the Online option with a tooltip when the user is not authenticated.",
  "frontend/src/components/GameResultsPanel.tsx": "Displays a modal overlay showing the game outcome (win, loss, or draw) with an appropriate icon, optional points earned, and buttons to start a new game or close the panel.",
  "frontend/src/components/GameStatus.tsx": "Shows a status bar with the current turn or game-over message, optional chess clocks for both players, and a mute/unmute toggle button.",
  "frontend/src/components/Leaderboard.tsx": "Fetches and displays a sorted leaderboard of players with their points, wins, and games played, resolving display names via actor profile queries and showing rank icons for the top three.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button using Internet Identity, handling the authentication flow and clearing the React Query cache on logout.",
  "frontend/src/components/MobileAppNotice.tsx": "Shows a dismissible bottom banner on mobile devices informing users there is no APK and suggesting they use 'Add to Home Screen' instead; dismissal state is persisted in localStorage.",
  "frontend/src/components/OnlineGameSetup.tsx": "Provides UI for creating or joining an online multiplayer game, generating a shareable game ID on creation and routing the user into the game once ready.",
  "frontend/src/components/PlayerIdentity.tsx": "Displays the authenticated user's display name (or truncated principal) with a user icon, rendering nothing when not logged in.",
  "frontend/src/components/PlayerStats.tsx": "Shows the authenticated player's points, wins, and games played as small pill badges, with a loading skeleton and no output when unauthenticated.",
  "frontend/src/components/ProfileSetupModal.tsx": "Presents a modal for new users to set a display name (2–30 characters), saving it via the actor and invalidating the profile query cache on success.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, returning either an anonymous or authenticated actor based on the current Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useBackgroundMusic.ts": "Provides background music playback using the Web Audio API with a C major pentatonic melody, exposing controls to start, stop, and toggle mute.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Fetches the current authenticated user's profile from the backend actor using React Query, waiting until the actor is ready.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication provider and hook using DFINITY's AuthClient, managing login state, identity persistence, and exposing login/logout functions via React context.",
  "frontend/src/hooks/useLeaderboard.ts": "Fetches the global leaderboard of player stats from the backend actor using React Query, refreshing every 60 seconds.",
  "frontend/src/hooks/useMoveSound.ts": "Plays a short chess move sound effect (oscillator click + noise burst) using the Web Audio API.",
  "frontend/src/hooks/useOnlineGame.ts": "Provides React Query hooks for fetching online game state (polling every 1.5s), creating a new game, and joining an existing game via the backend actor.",
  "frontend/src/hooks/usePlayerStats.ts": "Fetches the authenticated player's stats and provides a mutation to record AI match results, invalidating stats and leaderboard queries on success.",
  "frontend/src/index.css": "Global CSS file defining the chess app's dark theme using OKLCH custom properties, Tailwind base/component/utility layers, board square styles, and responsive layout utilities.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ChessGame.tsx": "Main chess game page component managing local/AI/online game modes, game state, move logic, castling, en passant, clocks, AI thinking, and rendering the board and UI panels.",
  "frontend/src/pages/OnlineChessGame.tsx": "React component for an online multiplayer chess game that syncs local game state with a backend canister, handles player color assignment, move submission, and displays the board with game status.",
  "frontend/src/types/chess.ts": "TypeScript type definitions for the chess application, including board/piece types, game state, positions, castling rights, and player stats.",
  "frontend/src/utils/ai-player.ts": "Implements a chess AI using minimax with alpha-beta pruning, including piece value tables and board evaluation for single-player mode.",
  "frontend/src/utils/backend-sync.ts": "Provides conversion utilities between the frontend's Unicode chess piece representation and the backend's typed Piece objects for board synchronization.",
  "frontend/src/utils/chess-setup.ts": "Provides functions to create the initial chess board layout and determine piece color from Unicode chess symbols.",
  "frontend/src/utils/game-status.ts": "Determines the current game status (playing, check, checkmate, stalemate, or draw) based on board state and available moves.",
  "frontend/src/utils/move-validation.ts": "Implements move validation logic for all chess pieces including pawns, knights, bishops, rooks, queens, and kings, plus board mutation via applyMove.",
  "frontend/src/utils/position-tracker.ts": "Tracks board positions using a serialized string map to detect threefold repetition draws.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session storage parameters, including game ID and secret token helpers for hash-based routing.",
  "frontend/src/utils/valid-moves.ts": "Provides utility functions to compute valid moves for a chess piece or all pieces of a player, including castling, en passant, and check filtering. Exports helpers to get moves for a single piece, validate ownership, retrieve all player moves, and check if any legal moves exist.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, defining custom screens, OKLCH-based color tokens, serif/display font families, border radii, chess-themed box shadows, and accordion animations. Includes the tailwindcss-animate and @tailwindcss/typography plugins.",
  "project_state.json": "Tracks the current project state (version 3) for Chess Khelo Online, listing two existing features: the full chess application rebuild and a dismissible mobile APK banner with localStorage persistence. No new feature requests or known issues are recorded."
}