{
  "backend/main.mo": "Main ICP actor implementing a chess platform backend with game management, player stats, and user profiles, all protected by role-based access control via AccessControl and MixinAuthorization mixins.",
  "feature_evidence.json": "Feature evidence report linking the logo fix feature (correcting asset reference in the HTML entry point) to its affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "A JSON document containing one-to-two sentence summaries of each frontend source file, serving as a reference index for the chess application's frontend codebase.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes, including colors for backgrounds, borders, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the Chess Khelo Online app, setting the favicon to a custom PNG asset, the page title, and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component that renders the ChessGame page directly as the sole application view.",
  "frontend/src/components/ChessBoard.tsx": "Renders the 8x8 chess board using ChessSquare components with support for selection, valid move, check, last-move highlights, AI thinking overlay, and game-over overlay; accepts a gameStarted prop to reduce opacity before play begins.",
  "frontend/src/components/ChessSquare.tsx": "Renders a single chess board square with piece display, coordinate labels, valid-move indicators, check/selection/last-move highlight overlays, and color-based piece styling.",
  "frontend/src/components/GameModeSelector.tsx": "Renders four game mode buttons (Two Players, vs AI, Auto Play, Online) with the active mode highlighted in gold.",
  "frontend/src/components/GameResultsPanel.tsx": "Modal dialog displaying the game result (win/draw with reason), points earned for authenticated users, and New Game/Close action buttons.",
  "frontend/src/components/GameStatus.tsx": "Displays the current chess game status including game-over overlays, player clocks, check warnings, AI thinking indicator, and a mute/unmute button.",
  "frontend/src/components/Leaderboard.tsx": "Fetches and renders a sorted leaderboard of top 20 players showing rank, display name, points, wins, and games played.",
  "frontend/src/components/LoginButton.tsx": "Renders a login/logout button using Internet Identity authentication, clearing the React Query cache on logout.",
  "frontend/src/components/OnlineGameSetup.tsx": "Provides UI for authenticated users to create or join an online chess game by generating/sharing a game ID, with login-required messaging for unauthenticated users.",
  "frontend/src/components/PlayerIdentity.tsx": "Displays the logged-in user's display name (from profile) or a shortened principal ID when authenticated.",
  "frontend/src/components/PlayerStats.tsx": "Fetches and displays the current player's points and wins in a compact badge-style component.",
  "frontend/src/components/ProfileSetupModal.tsx": "Shows a modal dialog prompting newly authenticated users without a profile to enter and save a display name.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useBackgroundMusic.ts": "Implements procedural background music using the Web Audio API, scheduling a looping C major pentatonic melody with start, stop, and mute controls.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the currently authenticated caller's user profile from the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useLeaderboard.ts": "React Query hook that fetches the global leaderboard (array of Principal/PlayerStats pairs) from the backend actor, refreshing every 60 seconds.",
  "frontend/src/hooks/useMoveSound.ts": "Hook that generates a procedural chess-piece move sound using the Web Audio API, combining a sine tone, triangle thud, and noise burst.",
  "frontend/src/hooks/useOnlineGame.ts": "Hook that manages online game state via React Query and mutations, providing game polling, game creation, and game joining functionality against the backend actor.",
  "frontend/src/hooks/usePlayerStats.ts": "React Query hook that fetches stats for the currently authenticated player from the backend, polling every 30 seconds.",
  "frontend/src/index.css": "Global stylesheet defining chess-themed CSS design tokens, Tailwind base/component/utility layers, and animations for board squares, pieces, and UI elements.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ChessGame.tsx": "Main chess game page component handling local, AI, and online game modes, including game state management, timers, move validation, AI moves, and UI for leaderboard and results.",
  "frontend/src/pages/OnlineChessGame.tsx": "Online multiplayer chess game page that syncs backend game state to a local board, handles optimistic move updates, and detects game-over conditions like checkmate and threefold repetition.",
  "frontend/src/types/chess.ts": "TypeScript type definitions for core chess domain objects including Board, Position, GameState, CastlingRights, and game mode/result enums.",
  "frontend/src/utils/ai-player.ts": "Implements a chess AI using minimax with alpha-beta pruning, evaluating board positions via material values and piece-square tables to select the best move for a given player.",
  "frontend/src/utils/backend-sync.ts": "Provides conversion utilities between the frontend's Unicode chess piece representation and the backend's typed Piece objects, mapping board arrays in both directions.",
  "frontend/src/utils/chess-setup.ts": "Creates the initial chess board with Unicode piece characters and exports helper functions and sets for identifying piece color.",
  "frontend/src/utils/game-status.ts": "Determines the current game status (playing, check, checkmate, stalemate, or draw) based on the board state, current player, and optional draw reason.",
  "frontend/src/utils/move-validation.ts": "Contains per-piece move validation logic (pawn, knight, bishop, rook, queen, king, castling) and checks such as whether a move would leave the king in check.",
  "frontend/src/utils/position-tracker.ts": "Tracks board position history using a serialized string key to detect threefold repetition for draw conditions.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL query parameters (including from hash-based routes), persisting them in sessionStorage, and cleaning sensitive params from the URL.",
  "frontend/src/utils/valid-moves.ts": "Computes all legal moves for a piece or player by combining basic move validation with check detection and castling rights, exposing helpers to enumerate or check existence of valid moves.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the theme with chess-specific colors, custom fonts (Playfair Display, EB Garamond), shadows, and keyframes, while enabling dark mode and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state for 'Chess Khelo Online' at version 3, recording a known logo display bug and a single existing feature request to fix the application logo asset reference."
}